langData["sa"] = {
  "begin": "प्रथमम् अङ्कानां वर्गाञ् जन&nbsp;। यदि एष विषयो गणक्रमस्योपयोगं करोति तर्हि वर्गं जन यस्य नाम Total इतीवास्ति तु तं तवाङ्कस्य १००% मन्य&nbsp;॥",
  "catInstruct": "यदि एष विषयो गणक्रमस्योपयोगं करोति तर्हि वर्गं जन यस्य नाम Total इतीवास्ति तदा तं तवाङ्कस्य १००% मन्य&nbsp;॥",
  "catNameExists": "एतस्य वर्गस्य नाम कस्यापि वर्तमानस्य वर्गस्यास्ति",
  "catList": "<strong>किमपि वर्गं क्लिक् कुरु</strong> कृत्यानि संकलनाय वापोहाय तस्य वर्गस्याङ्कस्य दर्शनायाधिकाभ्यः क्रियाभ्यश् च&nbsp;।<br><br>वर्गाः&nbsp;।<br>",
  "catAvg": "$CATEGORY माध्यम् $NUMBER%&nbsp;।",
  "avg": "<b>इदानीं यावदेतस्य वर्गस्यसमूहः $SCORE%&nbsp;।</b> अक्षराङ्कः $LETTER&nbsp;।<br>" +
    "निर्भारं GPA $GPA&nbsp;।<br>सर्वाणां वर्गाणाम् अङ्कः $SUM%&nbsp;। १००% अस्तव्य&nbsp;॥<br>",
  "noCat": "इदानीं किमपि वर्गश् इच्छत नास्ति",
  "selCat": "इदानीं यावत् $CATEGORY अङ्कः $SCORE%",
  "scoreNaN": "तव हरः शून्यम् अस्ति वान्यी समस्या भवत्येके वर्गे वैकाद् अधिके वर्गेषु&nbsp;। कतिपयाणां कृत्यानां संकलनं यत&nbsp;॥",
  "rampalInstruct": "<b>सर्वाणि कृत्यानीदं कुरु&nbsp;।</b><br>" +
    "कृत्यं क्लिक् कुरु<br>$IMG1<br>" +
    "<strong>Count as</strong> सङ्ख्याम् दृश्यवान् उपरि लिख&nbsp;॥<br>$IMG2",
  "catsFound": "$NUMBER वर्गाविन्द्यन्त&nbsp;। $CATEGORIES&nbsp;॥",
  "catsFound1": "एकोवर्गोऽविन्द्यत&nbsp;। $CATEGORIES&nbsp;॥",
  "catsFound2": "द्वौवर्गावविन्द्येताम्&nbsp;। $CATEGORIES&nbsp;॥",
  "pointCheck": "एष विषयो गणक्रमस्योपयोगं करोति&nbsp;।",
  "percentCheck": "एष विषयो प्रतिशतक्रमस्योपयोगं करोति&nbsp;।",
  "next": "अग्रिमे",
  "back": "प्रतिगच्छ",
  "done": "समाप्तम्",
  "continue": "अग्रिमंगच्छ",
  "help": "साहाय्यम्",
  "submit": "प्रेषणम्",
  "apply": "परिवर्तनम्",
  "add": "संकलनम्",
  "delete": "अपोहः",
  "menu": "कलनावलि",
  "edit": "अङ्कान्सम्पादनं&#8203;कुरु",
  "newClass": "नव्योविषयः",
  "notPossibleGrade": "सकष्टम् एषाङ्कस् तुभ्यम् अस्मिन् षण्मासे ऽसम्भवः&nbsp;। अग्रिमस्याय षण्मासाय यत&nbsp;॥",
  "minGrade": "न्यूनतमो ऽङ्को यः षण्मासस्य परीक्ष्यां सम्भवः $MIN%&nbsp;। $LETTER वा $NUMBER% रूपे प्रविश्यते&nbsp;॥",
  "fritzExam": "न्यूनतमो ऽङ्को यः षण्मासस्य परीक्ष्यां सम्भवः $MIN%&nbsp;। त्वं परीक्षएतावत् फ्रिट्स् नकरिष्यसीति ममाशा&nbsp;॥",
  "validData": "मान्यीं सूचनां प्रविश&nbsp;।",
  "mailSent": "तवोत्तरम् अप्रेष्यत तु विषय न्यूनस्यइव कालस्य पश्चाड् दृष्य&nbsp;। बहवो धन्यवादाः&nbsp;॥" +
    "<br>एतत्कालं प्रतिगन्तवान् हस्तेन भारान् प्रविश&nbsp;।<br>यदि विषय त्रयाणां दिवसाणां पश्चान् नदृश्यते तर्हि मया $EMAIL" +
    " भाष&nbsp;। तवानुरोधम् अहं नावगच्छामि तत् सम्भवम् अस्ति&nbsp;॥",
  "semGrade": "षण्मासाङ्कः $LETTER&nbsp;। $NUMBER%&nbsp;॥",
  "gpaClass": "$INDEX&nbsp;। $GPA&nbsp;॥ $GRADE&nbsp;। $LEVEL&nbsp;। $CREDITS&nbsp;॥",
  "gpaSum": "GPA संकलनम् $SUM&nbsp;।<br>सर्वाः पाठ्यक्रमांशाः $CREDITS&nbsp;।<br>चितं GPA एतत्कालम् $GPA&nbsp;॥",
  "reqScore_0": "त्वाम् $PTS/$TOT आवश्यकं विषये $GRADE% लाभस्यकृते",
  "reqScore": "त्वाम् $PTS/$TOT वा $PERCENT% आवश्यकं विषये $GRADE% लाभस्यकृते",
  "setLang": "भाषा&nbsp;",
  "welcome": "अङ्कगणके&#8203;स्वागतम्&nbsp;। प्रथमं&#8203;सर्वस्य&#8203;किं&#8203;तव " +
    "JavaScript अस्त्येवं&#8203;द्रष्टव्य&nbsp;। एतत्किंभवतीत्यदि&#8203;नजानासे&#8203;तर्हि&#8203;किमपि&#8203;समस्या&#8203;नास्ति&nbsp;। तुभ्यमहं&#8203;कर्तव्य&nbsp;।",
  "jsSuccess": "यदि&#8203;त्वमेतत्पठसि&#8203;तर्हितव JavaScript अस्तितथा&#8203;तस्य&#8203;पृष्ठस्योपयोगं&#8203;करतुं&#8203;शक्नोसि&nbsp;॥",
  "quarterGrades": "त्रिमासाङ्काः",
  "intro": "एवं पत्त्रम्&nbsp;। यद्यपि यन्त्राणि बह्विच्छामि तथापि यो ऽहम् मनुष्य एव&nbsp;। यदि किमपि भ्रम विन्दसि तर्हि मया $EMAIL भाषस्व &nbsp;॥" +
    "<br><strong>एतत् पृष्ठस्य चिह्नं कुरु</strong> एवं तत् सुगमं पश्यतुं शक्नोसि&nbsp;।" +
    "<br><br>आरम्भस्यकृते कलनम् इच्छ&nbsp;॥",
  "semGradesButton": "षण्मासस्य&#8203;वा&#8203;परीक्षायाङ्काः",
  "gpaCalcButton": "GPA गणकः",
  "newCatButton": "नव्योवर्गः",
  "catName": "नाम&nbsp;",
  "catPercent": "प्रतिशतम् &nbsp;",
  "createCat": "वर्गं&#8203;जन",
  "addAssignment": "कर्तव्यसंकलनम्",
  "deleteAssignment": "कर्तव्यापोहः",
  "editInstruct": "अङ्कम्/सम्भवम् एवं प्रविश&nbsp;। 5/6.0 8.5/9 3/3&nbsp;॥<br>" +
    "कर्तव्यस्यापोहाय तस्याङ्क <strong>तथैव</strong> लिखवान् कर्तव्यापोहः इति क्लिक् कुरु&nbsp;।<br>" +
    "<strong>कर्तव्यस्याङ्कस्य परिवर्तनाय</strong> 0 सङ्ख्यायाः कर्तव्यस्य संकलनम् वापवोहम् एवं कुरु&nbsp;। 5/0&nbsp;॥",
  "letterGrade": "अक्षराङ्कः&nbsp;",
  "selectLetter": "अक्षराङ्कम् इच्छ",
  "whatNeed": "आगमिनि कर्तव्ये मह्यं कियद् आवश्यकम्&nbsp;।",
  "creditCathy": "कथीटीक्वानेतस्मात् कर्तव्याद् धन्यवादः&nbsp;।",
  "desiredGrade": "अङ्को यद् विषये ऽस्तव्य&nbsp;",
  "numPointsWorth": "कर्तव्य कियत् सङ्ख्यानाम्&nbsp;",
  "calcRequiredButton": "आवश्यकस्याङ्कस्य&#8203;कलनं&#8203;कुरु",
  "changeWeightButton": "भारस्य&#8203;परिवर्तनम्",
  "weightChanged": "भारः $WEIGHT% भूत&nbsp;।",
  "deleteCatButton": "वर्गमपोहः",
  "copyGradesInstruct": "तवाङ्कान् MyBackpack प्रतिलिपिं कुरु यथा नीचे चित्रे दृषते&nbsp;।",
  "mobileCopyInstruct": "यदि किमपि <strong>हस्तयन्त्रे</strong> ऽस्यपि iPads तर्हि त्वम् <i>" +
    "Assignment</i> इषतवान् सर्वान् अङ्कानपीच्छ&nbsp;।",
  "pasteGradesInstruct": "इदानीम् एतान् नीचायाम् मञ्जूषायां लेपयतवान् <strong>अग्रिमे</strong> इति क्लिक् कुरु मञ्जूषायादस्&nbsp;।",
  "superAlgorithm": "मम यजतः क्रमस् तवाङ्कान् स्वच्छ करोतवान् एतद् भावितो ऽकरोत्&nbsp;। वर्गः, अङ्कः/सम्भवः&nbsp;॥",
  "dontWorry": "<strong>यदि किमप्यङ्को नास्ति</strong> किमपि वर्गे तर्हि स वर्ग एतस्याम् आवलौ नास्ति&nbsp;।" +
    " चिन्ता नभवेद्धस्तेन तस्य वर्गस्य संकलनम् कर्तुं शक्नोसि गणस्य पश्चात्&nbsp;। एवं यदि विषयो वर्गस्थाने" +
    " <strong>गणक्रमस्योपयोगं</strong> करोति तर्हि चिन्ता नभवेत्&nbsp;।",
  "shouldContinue": "किम् अग्रिमंगच्छामि&nbsp;।",
  "rampalButton": "श्रीराम्पालस्य&#8203;विषयाय",
  "rampalExp": "यद्यङ्को ऽनुचितस् तर्हि श्रीराम्पालस्य&#8203;विषयाय सह यत&nbsp;॥",
  "manualButton": "हस्तेनाङ्कान्प्रविश",
  "selClass": "<strong>विषयम् इष्तुं</strong> स्वचालितं प्रतिशतानि भारांश् च पूर्ण करोति&nbsp;। <span id=\"seth\">सेद्</span> घ्रोपरेतस्मात् कर्तव्याद् धन्यवादः&nbsp;॥",
  "selClassOption": "विषयम् इच्छ",
  "addClassOption": "विषयं प्रविश वोचितः कुरु",
  "sethClassInstruct": "वा सर्वाणां वर्गाणां प्रतिशतानि प्रविशेर् वैष विषयो गणक्रमस्योपयोगं करोतीति भाष&nbsp;।",
  "pointSystemInstruct": " किम् एष विषयो गणक्रमस्य वा वर्गाणाम् उपयोगं करोतीति विदितव्य&nbsp;। प्रश्नपत्त्राणि गृहकर्तव्यानि परीक्षाश् च कियद् गणानां सन्तीति द्रष्टव्य&nbsp;॥" +
    " यदि सर्वेषु वर्गेषु गणासन्नम् एक्याएव सङ्ख्यायाः सन्ति तर्हि वर्गा भवन्ति&nbsp;। अन्यथा गणक्रमः सम्भवः&nbsp;॥",
  "nameOfClass": "विषयस्य नाम&nbsp;",
  "pointSystemInstruct2": "<strong>गणक्रमेण</strong> नामसु भारेषु च point system इति लिख&nbsp;।",
  "enterCatNames": "वर्गाणां नामानि <strong>तथैव</strong> MyBackpack लिखतवन्तः&nbsp;",
  "enterWeights": "सर्वाणां वर्गाणां भारैतयावल्या&nbsp;",
  "enterNotes": "पत्त्रं काम्यम्&nbsp;",
  "minExam": "न्यूनतमो ऽङ्को यः षण्मासस्य परीक्ष्यां सम्भवः",
  "wantAtLeast": "न्यूनतम् इच्छामि&nbsp;",
  "selectAbove": "उपर्यङ्कान् इच्छ कलनस्यकृते",
  "semWithExam": "षण्मासाङ्कः परीक्षयासह",
  "noExam": "परीक्षा नास्ति",
  "ritvikCalc": "ऋत्विक्तिक्कवरपुस्य AHS GPA गणकः",
  "ritvikHonor": "ऋत्विक्तिक्कवरपुस्य सूचनया नामभिश् च",
  "clearDataButton": "GPA सूचनायोऽपोहः",
  "clearDataExp": "एतेन यदा पुनर् तस्मिन् पृष्ठे गच्छसि तदा तव GPA पुनर् प्रविश्तव्य&nbsp;। " +
    "यदि त्वं सूचनां रहस्यपोहस्थाने त्वज्ञाते मध्यमे नासि तर्हि सर्वं रक्षितम् अस्तव्य यदा पुनर् तस्मिन् पृष्ठे गच्छसि&nbsp;॥",
  "creditNum": "पाठ्यक्रमांशसङ्ख्या&nbsp;",
  "getCreditButton": "पाठ्यक्रमांशं&#8203;दृश",
  "modifyCreditHeading": "<b>पाठ्यक्रमांशस्य परिवर्तनं वापोहः</b>",
  "confirm": "किं त्वम् एवं कर्तुम् इच्छसि",
  "quarter13": "त्रिमासस्य प्रथमस्य वा तृतीयस्याङ्कः",
  "quarter24": "त्रिमासस्य द्वितीयस्य वा चतुर्थस्याङ्कः",
  "examGrade": "परीक्षाङ्कः",
  "semester": "षण्मासः",
  "quarter": "त्रिमासः",
  "ahsWeighted": "सभारम् GPA&nbsp;। AHS भाराः&nbsp;॥",
  "5scale": "५.० तुला",
  "4scale": "४.० तुला",
  "footer": "दल्विकृतम्&nbsp;।<br>आरम्भ आश्विनमासे ५१२० कलियुगे&nbsp;। श्रावणमासं ५१२२ कलियुगे पर्यन्तम्&nbsp;॥",
  "languages": [],
  "l_en": "आङ्ग्लभाषा",
  "l_es": "स्पैनिशभाषा",
  "l_pt": "पुर्तगालीभाषा",
  "l_hi": "हिन्दीभाषा",
  "l_ur": "उर्दूभाषा",
  "l_fa": "पारसीभाषा",
  "l_la": "लातिनीभाषा",
  "l_sa": "संस्कृतभाषा",
  "l_fr": "फ्रेञ्चभाषा",
  "l_bn": "वङ्गभाषा",
  "setPoint": "अङ्का गणक्रमो भवन्ति&nbsp;।",
  "setPercent": "अङ्का प्रतिशतक्रमो भवन्ति&nbsp;।",
  "search": "अन्वेषणम्",
  "pronunciation": "हारिस् दळ्वी&nbsp;। एवं वदस्व&nbsp;॥",
  "and": "च",
  "sanskrit": "संस्कृतम्",
  "translateMotto": "सङ्ख्यानां&#8203;पीडायाः&#8203;शान्तिम्"
};
const SANSKRIT_LETTER_MAP = {
"Brah": ["𑀅", "𑀆", "𑀇", "𑀈", "𑀉", "𑀊", "𑀏", "𑀐", "𑀑", "𑀒", "𑀋",
"𑁆", "𑀸", "𑀺", "𑀻", "𑀼", "𑀽", "𑁂", "𑁃", "𑁄", "𑁅", "𑀾", "𑀁", "𑀂", "𑁇", "𑁈", "",
"𑀓", "𑀔", "𑀕", "𑀖", "𑀗", "𑀘", "𑀙", "𑀚", "𑀛", "𑀜",
"𑀝", "𑀞", "𑀟", "𑀠", "𑀡", "𑀢", "𑀣", "𑀤", "𑀥", "𑀦",
"𑀧", "𑀨", "𑀩", "𑀪", "𑀫", "𑀬", "𑀭", "𑀮", "𑀯", "𑀰", "𑀱", "𑀲", "𑀳", "𑀴",
"𑁦", "𑁧", "𑁨", "𑁩", "𑁪", "𑁫", "𑁬", "𑁭", "𑁮", "𑁯", " "],
"Telu": ["అ", "ఆ", "ఇ", "ఈ", "ఉ", "ఊ", "ఏ", "ఐ", "ఓ", "ఔ", "ఋ",
"్", "ా", "ి", "ీ", "ు", "ూ", "ే", "ై", "ో", "ౌ", "ృ", "ం", "ః", "।", "॥", "ఽ",
"క", "ఖ", "గ", "ఘ", "ఙ", "చ", "ఛ", "జ", "ఝ", "ఞ",
"ట", "ఠ", "డ", "ఢ", "ణ", "త", "థ", "ద", "ధ", "న",
"ప", "ఫ", "బ", "భ", "మ", "య", "ర", "ల", "వ", "శ", "ష", "స", "హ", "ళ",
"0", "1", "2", "3", "4", "5", "6", "7", "8", "9", " "],
"Bali": ["ᬅ", "ᬆ", "ᬇ", "ᬈ", "ᬉ", "ᬊ", "ᬏ", "ᬐ", "ᬑ", "ᬒ", "ᬋ",
"᭄", "ᬵ", "ᬶ", "ᬷ", "ᬸ", "ᬹ", "ᬾ", "ᬿ", "ᭀ", "ᭁ", "ᬺ", "ᬂ", "ᬄ", "᭞", "᭟", "",
"ᬓ", "ᬔ", "ᬕ", "ᬖ", "ᬗ", "ᬘ", "ᬙ", "ᬚ", "ᬛ", "ᬜ",
"ᬝ", "ᬞ", "ᬟ", "ᬠ", "ᬡ", "ᬢ", "ᬣ", "ᬤ", "ᬥ", "ᬦ",
"ᬧ", "ᬨ", "ᬩ", "ᬩ", "ᬫ", "ᬬ", "ᬭ", "ᬮ", "ᬯ", "ᬰ", "ᬱ", "ᬲ", "ᬳ", "ᬮ",
"᭐", "᭑", "᭒", "᭓", "᭔", "᭕", "᭖", "᭗", "᭘", "᭙", "&#8203;"],
"Tibt": ["ཨ", "ཨཱ", "ཨི", "ཨཱི", "ཨུ", "ཨཱུ", "ཨེ", "ཨཻ", "ཨོ", "ཨཽ", "ཨྲྀ",
"྄", "ཱ", "ི", "ཱི", "ུ", "ཱུ", "ེ", "ཻ", "ོ", "ཽ", "ྲྀ", "ཾ", "ཿ", "།", "༎", "྅",
"ཀ", "ཁ", "ག", "གྷ", "ང", "ཙ", "ཚ", "ཛ", "ཛྷ", "ཉ",
"ཊ", "ཋ", "ཌ", "ཌྷ", "ཎ", "ཏ", "ཐ", "ད", "དྷ", "ན",
"པ", "ཕ", "བ", "བྷ", "མ", "ཡ", "ར", "ལ", "ཝ", "ཤ", "ཥ", "ས", "ཧ", "ལ",
"༠", "༡", "༢", "༣", "༤", "༥", "༦", "༧", "༨", "༩", "&#8203;"],
"Khmr": ["អ", "អា", "ឥ", "ឦ", "ឧ", "ឩ", "ឯ", "ឰ", "ឱ", "ឳ", "ឫ",
"្", "ា", "ិ", "ី", "ុ", "ូ", "េ", "ៃ", "ោ", "ៅ", "្ឫ", "ំ", "ះ", "។", "៕", "ៜ",
"ក", "ខ", "គ", "ឃ", "ង", "ច", "ឆ", "ជ", "ឈ", "ញ",
"ដ", "ឋ", "ឌ", "ឍ", "ណ", "ត", "ថ", "ទ", "ធ", "ន",
"ប", "ផ", "ព", "ភ", "ម", "យ", "រ", "ល", "វ", "ឝ", "ឞ", "ស", "ហ", "ឡ",
"០", "១", "២", "៣", "៤", "៥", "៦", "៧", "៨", "៩", "&#8203;"],
"Mlym": ["അ", "ആ", "ഇ", "ഈ", "ഉ", "ഊ", "ഏ", "ഐ", "ഓ", "ഔ", "ഋ",
"്", "ാ", "ി", "ീ", "ു", "ൂ", "േ", "ൈ", "ോ", "ൌ", "ൃ", "ം", "ഃ", "।", "॥", "ഽ",
"ക", "ഖ", "ഗ", "ഘ", "ങ", "ച", "ഛ", "ജ", "ഝ", "ഞ",
"ട", "ഠ", "ഡ", "ഢ", "ണ", "ത", "ഥ", "ദ", "ധ", "ന",
"പ", "ഫ", "ബ", "ഭ", "മ", "യ", "ര", "ല", "വ", "ശ", "ഷ", "സ", "ഹ", "ള",
"0", "1", "2", "3", "4", "5", "6", "7", "8", "9", " "]};

const DEVANAGARI = ["अ", "आ", "इ", "ई", "उ", "ऊ", "ए", "ऐ", "ओ", "औ", "ऋ",
  "्", "ा", "ि", "ी", "ु", "ू", "े", "ै", "ो", "ौ", "ृ", "ं", "ः", "।", "॥", "ऽ",
  "क", "ख", "ग", "घ", "ङ", "च", "छ", "ज", "झ", "ञ",
  "ट", "ठ", "ड", "ढ", "ण", "त", "थ", "द", "ध", "न",
  "प", "फ", "ब", "भ", "म", "य", "र", "ल", "व", "श", "ष", "स", "ह", "ळ",
  "०", "१", "२", "३", "४", "५", "६", "७", "८", "९", " "];

var iast_consonants = ["k", "kh", "g", "gh", "ṅ", "c", "ch", "j", "jh", "ñ",
"ṭ", "ṭh", "ḍ", "ḍh", "ṇ", "t", "th", "d", "dh", "n",
"p", "ph", "b", "bh", "m", "y", "r", "l", "v", "ś", "ṣ", "s", "h", "ḷ"];
var iast_vowels = ["a", "ā", "i", "i", "u", "u", "e", "ai", "o", "au", "ṛ"];
var iast_matras = ["āṃ", "āḥ", "iṃ", "iḥ", "īṃ", "īḥ", "uṃ", "uḥ", "ūm", "ūḥ", "eṃ", "eḥ", "aiṃ", "aiḥ", "oṃ", "oḥ", "auṃ", "auḥ",
"", "ā", "i", "ī", "u", "ū", "e", "ai", "o", "au", "ṛ", "aṃ", "aḥ"];
var devanagari_consonants = ["क", "ख", "ग", "घ", "ङ", "च", "छ", "ज", "झ", "ञ",
  "ट", "ठ", "ड", "ढ", "ण", "त", "थ", "द", "ध", "न",
  "प", "फ", "ब", "भ", "म", "य", "र", "ल", "व", "श", "ष", "स", "ह", "ळ",
  "ः", "ं"];
var devanagari_vowels = ["अ", "आ", "इ", "ई", "उ", "ऊ", "ए", "ऐ", "ओ", "औ", "ऋ"];
var devanagari_matras = ["ां", "ाः", "िं", "िः", "ीं", "ीः", "ुं", "ुः", "ूं", "ूः", "ें", "ेः", "ैं", "ैः", "ों", "ोः", "ौं", "ौः",
  "्", "ा", "ि", "ी", "ु", "ू", "े", "ै", "ो", "ौ", "ृ", "ं", "ः"];

const SANSKRIT_SCRIPT = {
  "Deva": "लिपिः (Script) ",
  "Brah": "𑀮𑀺𑀧𑀺𑀂 (Script) ",
  "Latn": "Script ",
  "Telu": "లిపిః (Script) ",
  "Bali": "ᬮᬶᬧᬶᬄ (Script) ",
  "Tibt": "ལིཔིཿ (Script) ",
  "Khmr": "លិបិះ (Script) ",
  "Mlym": "ലിപിഃ (Script) "
};

const SKT_DIGIT_CONST = {
  "Deva": ["०", "१", "२", "३", "४", "५", "६", "७", "८", "९"],
  "Brah": ["𑁦", "𑁧", "𑁨", "𑁩", "𑁪", "𑁫", "𑁬", "𑁭", "𑁮", "𑁯"],
  "Latn": ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
  "Telu": ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
  "Bali": ["᭐", "᭑", "᭒", "᭓", "᭔", "᭕", "᭖", "᭗", "᭘", "᭙"],
  "Tibt": ["༠", "༡", "༢", "༣", "༤", "༥", "༦", "༧", "༨", "༩"],
  "Khmr": ["០", "១", "២", "៣", "៤", "៥", "៦", "៧", "៨", "៩"],
  "Mlym": ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
};

function brahmic_key(keys, k, d, n_l, n_s) {
  if (["Bali", "Tibt"].indexOf(d) != -1) {
    referenceKey(keys[k], "&nbsp;।", "।");
    referenceKey(keys[k], "&nbsp;॥", "॥");
  }
  if (["Khmr"].indexOf(d) != -1) {
    referenceKey(keys[k], "। ", "।&nbsp;");
    referenceKey(keys[k], "॥ ", "॥&nbsp;");
  }
  for (var i = 0; i < DEVANAGARI.length; i++)
    referenceKey(keys[k], DEVANAGARI[i], n_l[i]);
  for (var i = 0; i < currentLangData[keys[k]].length; i++) {
    if (SANSKRIT_DIGITS.concat("%").indexOf(currentLangData[keys[k]].substring(i,i+1)) != -1) {
      if (i == currentLangData[keys[k]].length ||
      SANSKRIT_DIGITS.concat([".","%"]).indexOf(currentLangData[keys[k]].substring(i+1,i+2)) == -1) {
        currentLangData[keys[k]] = currentLangData[keys[k]].substring(0,i+1) + n_s +
        currentLangData[keys[k]].substring(i+1);
        i += n_s.length;
      }
      if (i == 0 || SANSKRIT_DIGITS.concat([".","%"]).indexOf(currentLangData[keys[k]].substring(i-1,i)) == -1) {
        currentLangData[keys[k]] = currentLangData[keys[k]].substring(0,i) + n_s +
        currentLangData[keys[k]].substring(i);
        i += n_s.length;
      }
    }
  }
  referenceKey(keys[k], "$NUMBER", n_s+"$NUMBER"+n_s);
  referenceKey(keys[k], n_s+"$NUMBER"+n_s+"%", n_s+"$NUMBER%"+n_s);
  referenceKey(keys[k], "$SCORE%", n_s+"$SCORE%"+n_s);
  referenceKey(keys[k], "$MIN%", n_s+"$MIN%"+n_s);
  referenceKey(keys[k], "$WEIGHT%", n_s+"$WEIGHT%"+n_s);
  referenceKey(keys[k], "$PTS/$TOT", n_s+"$PTS/$TOT"+n_s);
  referenceKey(keys[k], "AHS&#8203;GPA", "AHS GPA");
  switch(d) {
    case "Bali":
      referenceKey(keys[k], "᭞&#8203;", "᭞ ");
      referenceKey(keys[k], "᭟&#8203;", "᭟ ");
      break;
    case "Tibt":
      referenceKeys(keys[k],["ང།", "ང༎"], ["ང༌།", "ང༌༎"]);
      referenceKeys(keys[k], ["ཀ།", "ཀ༎"], ["ཀ&nbsp;།", "ཀ&nbsp;༎"]);
      referenceKeys(keys[k], ["ག།", "ག༎"], ["ག&nbsp;།", "ག&nbsp;༎"]);
      referenceKeys(keys[k], ["།&#8203;", "༎&#8203;"], ["།&ensp;", "༎&ensp;"]);
      for (var i = 0xF40; i <= 0xF67; i++)
        referenceKey(keys[k], "྄"+String.fromCharCode(i), String.fromCharCode(i+0x50));
      break;
    case "Khmr":
      referenceKeys(keys[k], ["្&#8203;", "្&nbsp;"], ["៑&#8203;", "៑&nbsp;"]);
      if (currentLangData[keys[k]].endsWith("្")) {
        currentLangData[keys[k]] = currentLangData[keys[k]].substring(0,
        currentLangData[keys[k]].length-1) + "៑";
      }
      break;
    case "Mlym":
      referenceKeys(keys[k], ["ണ് ", "ണ്&nbsp", "ന് ", "ന്&nbsp"], ["ൺ ", "ൺ&nbsp;", "ൻ ", "ൻ&nbsp;"]);
      referenceKeys(keys[k], ["ല് ", "ല്&nbsp", "ള് ", "ള്&nbsp"], ["ൽ ", "ൽ&nbsp;", "ൾ ", "ൾ&nbsp;"]);
      referenceKeys(keys[k], ["ക് ", "ക്&nbsp"], ["ൿ ", "ൿ&nbsp;"]);
      break;
  }
}
function sa_latin_key(keys, k) {
  for (var i = 0; i < devanagari_consonants.length; i++) {
    for (var j = 0; j < devanagari_matras.length; j++) {
      referenceKey(keys[k], devanagari_consonants[i]+devanagari_matras[j],
        iast_consonants[i]+iast_matras[j]);
    }
  }
  for (var i = 0; i < devanagari_vowels.length; i++)
    referenceKey(keys[k], devanagari_vowels[i], iast_vowels[i]);
  for (var i = 0; i < devanagari_consonants.length; i++)
    referenceKey(keys[k], devanagari_consonants[i], iast_consonants[i]+"a");
  for (var i = 0; i <= 9; i++)
    referenceKey(keys[k], ["०", "१", "२", "३", "४", "५", "६", "७", "८", "९"][i], ""+i);
  referenceKeys(keys[k], ["ऽ", "।", "॥"], ["'", "|", "||"]);
}

languageLoaded("sa");