langData["ur"] = {
  "begin": "شروع ہونے کے لئے گریڈز کو کیٹیگریز بناؤ۔ اگر یہ کلاس پوئنٹ سسٹم کا استعمال کرے، کیٹیگری بناؤ جس کا نام کچھ" + " \"Total\" " +
    "جیسا ہے اور اُس کو آپ کے گریڈ کا 100% مانو۔",
  "catInstruct": "اگر یہ کلاس پوئنٹ سسٹم کا استعمال کرے، کیٹیگری بناؤ جس کا نام کچھ" + " \"Total\" " +
    "جیسا ہے اور اُس کو آپ کے گریڈ کا 100% مانو۔ کویئ کیٹیگری مت بناؤ جس کا نام پہلے سے کسی اور کیٹیگری کا ہے، کیوں کہ میں" +
    "آپ کو اِس میں روکنے کے لئے بہت کامچور ہوں۔",
  "catList": "<strong>کسی کیٹیگری کو کلک کرو</strong> اسائنمئنٹس کو ایڈ یا ڈیلیٹ کرنے کے لئے اور اُس کیٹیگری کا سکور دیکھنے کے لئے۔<br><br>کیٹیگریز:<br>",
  "catAvg": "$CATEGORY کا اوسط: $NUMBER%",
  "avg": "ابھی تک اِس کلاس کا سکور: $SCORE% (لیٹر گریڈ: $LETTER)<br>" +
    "انویٹِد GPA: $GPA<br>سبھی کیٹیگریز کا جوڑ: $SUM% (100% ہونا چاہئے)<br>",
  "noCat": "ابھی کویئ کیٹیگری چنی ہوئی نہیں ہے",
  "selCat": "ابھی تک $CATEGORY کا سکور: $SCORE%",
  "scoreNaN": "آپ کا ڈینامینیٹر صفر ہے یا کویئ اور غلطی ہے ایک یا ایک سے زیادہ کیٹیگریز میں۔ کچھ اسائنمنٹس اید کرنے کی کوشش کرو۔",
  "rampalInstruct": "<b>ہر ایک اسائنمنٹ کے لئے یہ کرو:</b><br>" +
    "اسائنمنٹ کو کلک کرو<br><img src=\"rampal/rampal1.png\"><br><img src=\"rampal/rampal2.png\"><br><strong>\"Count as\"</strong> والا نمبر دیکھ کے اوپر ڈالو",
  "catsFound": "$NUMBER کیٹیگریز ملیں: $CATEGORIES",
  "pointCheck": "یہ کلاس پوئنٹ سسٹم ہے۔",
  "next": "آگے",
  "back": "واپس",
  "done": "ختم",
  "continue": "آگے بڑھو",
  "help": "مدد",
  "submit": "سبمٹ",
  "apply": "لاگو کرو",
  "add": "ایڈ کرو",
  "delete": "ڈیلیٹ کرو",
  "edit": "گریڈز کو ایڈِٹ کرو",
  "newClass": "نیا کلاس (آٹومیٹک)",
  "notPossibleGrade": "بد قسمتی سے یہ گریڈ آپ کے لئے اِس سمسٹر ناممکن ہے۔ اگلے سمسٹر کے لئے کوشش کرتے رہو!",
  "minGrade": "سب سے کم گریڈ جو سمسٹر ایگزام پہ مل سکتا: $MIN% ($LETTER/$NUMBER% کے روپ میں داخل ہو جاتا ہے)",
  "fritzExam": "سب سے کم گریڈ جو سمسٹر ایگزام پہ مل سکتا: $MIN% (مجھے امید ہے کہ آپ ایگزام پہ اِتنا Fritz نہ کرو گے)",
  "validData": "صحیح ڈیٹا داخل کرنا ہے۔",
  "mailSent": "آپ کے جواب بھیجا ہوا ہے اور کلاس کو بس تھوڑی دیر بعد نظر آنا چاہئے۔ شکریہ!" +
    "<br>ابھی کے لئے، واپس جا کے ہاتھ سے ویٹنگز داخل کرو۔<br>اگر کلاس تین دن بعد نظر نہ آئے، مجھے bd542591@ahschool.com پہ" +
    "ضرور کانٹیکٹ کرو؛ شاید آپ کی عرض مجھے سمجھ نہیں آ رہی ہے۔",
  "semGrade": "سمسٹر کا گریڈ: $LETTER ($NUMBER%)",
  "gpaClass": "$INDEX: $GPA ($GRADE، $LEVEL، $CREDITS کریڈٹس)",
  "gpaSum": "<b>GPA کا جوڑ: $SUM<br>سارے کریڈٹس: $CREDITS<br>جمع GPA ابھی تک: $GPA</b>",
  "reqScore_0": "آپ کو $TOT میں سے $PTS ملنا ضروری ہے کلاس میں $GRADE% پانے کے لئے",
  "reqScore": "آپ کو $TOT میں سے $PTS ($PERCENT%) ملنا ضروری ہے کلاس میں $GRADE% پانے کے لئے",
  "setLang": "زبان&nbsp;",
  "welcome": "گریڈ کیلکولیٹر میں آپ کو خوش آمدید۔ سب سے پہلے، آپ کو دوکھنا ہے کہ کیا آپ کے پاس " +
    "JavaScript ہے۔ اگر آپ کو پتا نہیں ہے کہ یہ کیا ہے، کوئی بات نہیں۔ میں آپ کے لئے کر دوں گا:",
  "jsSuccess": "اگر آپ یہ پڑھ رہے ہو، آپ کے پاس JavaScript ہے اور آپ اِس پیج کا استعمال کر سکتے ہو۔",
  "quarterGrades": "کوارٹر کے گریڈز",
  "intro": "<b>نوٹ:</b> ہالاں کہ کمپیوٹرز کا مجھے بہت شوق ہے، میں بھی انسان ہی ہوں۔ مجھے bd542591@ahschool.com پہ کانٹیکٹ کرو اگر آپ کو کویئ غلطی نظر آئے۔" +
    "<br><strong>اِس پیج کو بُکمارک کرو</strong> تاکہ آپ آسانی سے ڈھونڈ سکو گے۔" +
    "<br><br>شروع کرنے کے لئے ایک حساب چن لو:",
  "semGradesButton": "سمسٹر/ایگزام کے گریڈز",
  "gpaCalcButton": "GPA کیلکولیٹر",
  "newCatButton": "نئی کیٹیگری",
  "catName": "نام:&nbsp;",
  "catPercent": "پرسنٹیج:&nbsp;",
  "createCat": "کیٹیگری بناؤ",
  "addAssignment": "ایڈ اسائنمنٹ",
  "deleteAssignment": "ڈیلیٹ اسائنمنٹ",
  "editInstruct": "سکور/ممکن داخل کرو۔ جیسے: 6.0/5، 9/8.5، 3/3۔ سکور دائیں پہ، ممکن بائیں پہ۔<br>" +
    "اسائنمنٹ کو ڈیلیٹ کرنے کے لئے، اُس کا سکور <strong>اُسی طرح</strong> لکھ کے \"ڈیلیٹ اسائنمنٹ\" کو کلک کرو۔<br>" +
    "<strong>اسائنمنٹ کا گریڈ بدلنے کے لئے</strong>، 0 پوئنٹس کا اسائنمنٹ ایڈ یا ڈیلیٹ کرو (جیسے: 0/5)۔",
  "letterGrade": "لیٹر گریڈ:&nbsp;",
  "selectLetter": "ایک لیٹر گریڈ کو چن لو",
  "whatNeed": "آنے والے اسائنمنٹ پہ مجھے کیا چاہئے؟",
  "creditCathy": "کیتھی ٹی۔ کوان کو اِس آئڈیا کے لئے شکریہ",
  "desiredGrade": "گریڈ جو کلاس میں چاہئے:&nbsp;",
  "numPointsWorth": "اسائنمنٹ کتنے پوئنٹس کا ہے:&nbsp;",
  "calcRequiredButton": "ضروری والے سکور کا حساب کرو",
  "changeWeightButton": "ویٹنگ کو بدل دو",
  "copyGradesInstruct": "آپ کے گریڈز بس ذرا MyBackpack سے کاپی کرو جیسے نیچے والی تصویر میں دکھایا ہوں۔",
  "mobileCopyInstruct": "(اگر آپ کسی <strong>موبائل ڈوائس</strong> پہ ہو، iPads بھی، آپ کو <i>" +
    "Assignment</i> سلیکٹ کر کے سارے گریڈز بھی سلیکٹ کرنے ہوں گے )",
  "pasteGradesInstruct": "اب اِنہیں نیچے والے بکسے میں پیسٹ کر کے <strong>آگے</strong> کلک کرو بکسے کے نیچے:",
  "superAlgorithm": "میرے بڑے کُول الگورتھم نے آپ کے گریڈز کو صاف کر کے یہ بنا دیا (کیٹیگری، سکور/ممکن):",
  "dontWorry": "<strong>اگر کویئ گریڈز نہیں ہیں</strong> کسی کیٹیگری کے لئے، وہ کیٹیگری اوپر والے لِسٹ سے غائب ہو گی۔" +
    "فقر مت کرو، آپ ہاتھ سے اُس کو ایڈ کر سکتے ہو حساب کے بعد۔ اور اگر کلاس کیٹیگریز کے بجائے" +
    " <strong>پوئنٹ سسٹم</strong> کا استعمال کرتا ہے، یہ بھی کویئ بات نہیں ہے۔",
  "shouldContinue": "آگے بڑھوں؟",
  "rampalButton": "مسٹر رامپال کے کلاس کے لئے اِدھر کلک کرو",
  "manualButton": "ہاتھ سے گریڈز داخل کرو",
  "selClass": "<strong>ایک کلاس چنو</strong> آٹومیٹکلی پرسنٹیج اور ویٹنگ کو بھرنے کے لئے۔ (<span id=\"seth\">سیتھ</span> گروپر کو اِس آئڈیا کے لئے شکریہ)",
  "selClassOption": "ایک کلاس چنو",
  "addClassOption": "اِس لسٹ میں کویئ اور کلاس ڈالو",
  "sethClassInstruct": "یا تو ہر ایک کیٹیگری کا ایک پرسنٹیج ڈالو، یا چیک مارک دباؤ کہ یہ کلاس پوئنٹ سسٹم ہے:",
  "pointSystemInstruct": "پتا کرنے کے لئے کہ کیا یہ کلاس پوئنٹ سسٹم یا کیٹیگریز ہے، دیکھو کہ کوِزیز، ہومورک، اور ٹیسٹس کتنے پوئنٹس کے ہئں۔" +
    " اگر پوئنٹس لگبھگ ایک ہی نمبر کے ہیں، کیٹیگریز ہے۔ ورنا شاید پوئنٹ سسٹم ہوگا۔",
  "nameOfClass": "کلاس کا نام:&nbsp;",
  "pointSystemInstruct2": "<strong>پوئنٹ سسٹم</strong> کے لئے، ناموں اور ویٹس کے لئے &rdquo;point system&ldquo; لکھ سکتے ہو۔",
  "enterCatNames": "کیٹیگریز کے نام <strong>ہوباہو</strong> جیسے MyBackpack میں دکھتے ہیں:&nbsp;",
  "enterWeights": "ہر کیٹیگری کا ویٹ اوپر والے آرڈر میں:&nbsp;",
  "enterNotes": "نوٹس (اگر چاہو تو):&nbsp;",
  "minExam": "سب سے کم گریڈ جو سمسٹر ایگزام پہ مل سکتا",
  "wantAtLeast": "مجھے کم از کم یہ چاہئے:&nbsp;",
  "selectAbove": "اوپر گریڈز سلیخٹ کرو حساب کرنے کے لئے",
  "semWithExam": "سمسٹر گریڈ ایگزام کے ساتھ",
  "ritvikCalc": "رِتوِک تیگوَرپو AHS GPA کیلکولیٹر",
  "ritvikHonor": "رِتوِک تیگوَرپو کی صلاح اور نام سے",
  "clearDataButton": "GPA دیٹا کو ہٹاؤ",
  "clearDataExp": "اِس کے ساتھ جب آپ اگلی بار اِس پیج پہ آؤ گے آپ کو اپنا GPA دوبارہ داخل کرنا ہوگا۔" +
    " یہ اِس وقت پیج سے ڈیٹا <strong>نہیں</strong> ہٹائے گا۔<br><br>" +
    "اگر آپ ڈیٹا کو رہنے دو بجائے کہ ہٹاؤ، سب کچھ سیو ہو گا جب آپ اگلی بار اِس پیج پر آؤ گے۔",
  "creditNum": "کریڈٹ نمبر&nbsp;",
  "getCreditButton": "کریڈٹ کو دیکھو",
  "modifyCreditHeading": "<b>گریڈز کو بدلو/ہٹاؤ</b>",
  "confirm": "کیا آپ کو یقین ہے کہ آپ کو یہ کرنا ہے؟"
};
